{
  "_name_or_path": "KISTI-AI/scideberta-cs",
  "architectures": [
    "DebertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DatasetName",
    "2": "I-DatasetName",
    "3": "B-HyperparameterName",
    "4": "I-HyperparameterName",
    "5": "B-HyperparameterValue",
    "6": "I-HyperparameterValue",
    "7": "B-MethodName",
    "8": "I-MethodName",
    "9": "B-MetricName",
    "10": "I-MetricName",
    "11": "B-MetricValue",
    "12": "I-MetricValue",
    "13": "B-TaskName",
    "14": "I-TaskName"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DatasetName": 1,
    "B-HyperparameterName": 3,
    "B-HyperparameterValue": 5,
    "B-MethodName": 7,
    "B-MetricName": 9,
    "B-MetricValue": 11,
    "B-TaskName": 13,
    "I-DatasetName": 2,
    "I-HyperparameterName": 4,
    "I-HyperparameterValue": 6,
    "I-MethodName": 8,
    "I-MetricName": 10,
    "I-MetricValue": 12,
    "I-TaskName": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "c2p",
    "p2c"
  ],
  "position_biased_input": false,
  "relative_attention": true,
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "type_vocab_size": 0,
  "vocab_size": 50265
}
